<?php include('data.php')?>
<?php include('header.php')?>



<div id="panel"> 
    <h1>WeHelp 申請書 林琬儒</h1>
    <div id="question-list">  
        1.個人簡介
    </div>
    <div id="content">  
        &nbsp&nbsp&nbsp&nbsp大學為逢甲機械，研究所為成大機械固力組，畢業後於華創待任七年多的車體結構強度模擬工程師，在第二個小孩出生後離職在家育嬰，並思考人生的下一步，因為原本的工作環境大多為整天坐辦公室的而有小孩之後開始想要有彈性的工時與能遠端工作的類型，一直很羨慕朋友軟體工程師可以不限地點的工作，因而有了轉職的念頭。在家育兒如今已經三年，小孩也於今年就讀幼兒園，覺得需加強自己的能力，並重返職場。    </div>
    <div id="question-list">  
        2.為了成為軟體工程師，曾做過什麼努力？若有具體專案作品請分享給我們
    </div>
    <div id="content">  
        線上課程自學:<br>
        網頁15天的:<br>
        Git版本控制就像寫日記<br>
        <br>
        茶米老師教室:<br>
        Python程式基礎入門(一), Python程式基礎入門(二)<br>
        Python程式進階應用(一), Python程式進階應用(二)<br>
        Python物件導向程式開發(一), Python物件導向程式開發(二)<br>
        網路爬蟲與資料應用(一), 網路爬蟲與資料應用(二) <br>
        大數據收集、分析與視覺化(一)<br>
        <br>
        書本閱讀:<br>
        PHP程式設計<br>
        <br>
        網路文章自學<br>
        Lumen Rest Api <br>
        Leetcode練習(使用php)<br>

    
    </div>
    <div id="question-list">  
        3. 如果參與這個計畫，會怎麼安排學習時間？
    </div>
    <div id="content">  
        先以老師公布的每週工作來規劃每天需要達到什麼目標<br>
        每天送小孩上學後9:00-17:30可以專心學習<br>
        晚上等待小孩入睡後再補足當天需要的進度<br>
        

    
    </div>
    <div id="question-list">  
        4. 是否有想要加入的軟體公司？為什麼想加入該公司？
    </div>
    <div id="content">  
        Google , Yahoo , Line <br>
        &nbsp&nbsp&nbsp&nbsp因為聽聞外商大公司都是福利好，工時自由，且非常多高手聚集，很希望自己有一天能進入這些大公司磨練看看，雖然知道以目前的能力上面這三間公司都是謠不可及的夢想，但希望如果轉職成功第二份或第三份的工作有機會能到上面三家大公司去闖看看。

    </div>
    <div id="question-list">  
        5. 請描述一件你曾經碰到最困難的事情，如何克服？
    </div>
    <div id="content">  
        &nbsp&nbsp&nbsp&nbsp之前的工作為車體強度結構分析，曾經被長官指派建立動態模擬SOP，因為原本公司的車門模擬分析主要是用靜態的方式去預估在不同外力作用下，車門的弱點在哪，動態模擬則是需要將關門的瞬間狀態模擬出來，並去解析可能的弱點，以減少在實車測試中可能遇到的強度問題。因為模擬的方式是以前沒有遇過的，所以為了完成這份SOP的過程遇到了材料、模型設計等許多以前沒遇到的問題。但因為沒有前人的建模的經驗，只能自己上網找尋資料以及文獻，並利用以前實車的測試數據，去比對自己的模擬設定是否有與真實的狀況接近。雖然為了建立這份SOP花費了許多時間，但寫出來後可以幫助以後的同事在建立模型時，少走一些冤望路。並可以實際減少在實車測試中可能出現的破壞問題。</div>
    <div id="question-list">  
        6. 關於這份申請網頁，請分享一個你開發時的技術心得。
    </div>
    <div id="content">  
        &nbsp&nbsp&nbsp&nbsp在看線上課程的時候總覺得跟著實作好像不會很困難，有一種看過就覺得好像自己學會了新知識，但實際真的要自己從零開始建立一個網頁出來，就算只是一個簡單的格式，好像瞬間都變成一個困難的題目。覺得自己實作真的是很重要的事。舉例就像平常在word書寫報告時僅需要用tab鍵就能在文章的起頭給段落空格，在這次製作申請表中才發現在程式中，需要&nbsp程式碼才能有相同的效果。體認到只有自己去實作碰到問題並找尋解答才能印象深刻。
      </div>
    <div id="question-list">  
        7.其他想說的
    </div>
    <div id="content">  
        &nbsp&nbsp&nbsp&nbsp雖然不知道自己是否會申請成功，也知道高手非常多，但我覺得需要一個機會嘗試看看，自學後才知道軟體工程師的路很廣，廣到有點不知道自己降亂無章法的到處學一點是否真的能順利轉職，如果有機會的想體驗看看老師是如何讓我們從中慢慢的自我學習到轉職，雖然知道這路一定會很辛苦，也不知道是否有機會錄取，也不知道錄取自己是否可以跟上其他人的腳步，但就是給自己一個機會，希望能有機會能接受老師的訓練挑戰。 </div>
</div>

<?php include('footer.php')?>